Repository: razeranthom/exam
Catalog: exam/locales/*/LC_MESSAGES/*.po
Languages: pt_br

source: ERROR:
pt_br: ERRO:

source: Usage:
pt_br: Uso:

source: Commands:
pt_br: Comandos:

source: help : show this message
pt_br: help : mostra esta mensagem

source: init <name> : create new <name>.yaml file, create template files
pt_br: init <nome> : cria novo arquivo <nome>.yaml, cria arquivos de template

source: new <name> : given a <name>.yaml file, create a new exam
pt_br: new <nome> : dado um arquivo <name>.yaml, cria um novo exame

source: latex <name> : generate latex and PDF of exam from previous generated exam
pt_br: latex <nome> : gera arquivos latex e PDF de um exame previamente gerado

source: generate <name> : with .yaml file, calls new and latex
pt_br: generate <nome> : com o arquivo <nome>.yaml, chama new e latex

source: show <name> : show configurations
pt_br: show <nome> : mostra configurações

source: showConfig : show global configurations
pt_br: showConfig : mostra configurações globais

source: clear <name> : remove generated exam files
pt_br: clear <nome> : remove os arquivos gerados de um exame

source: remove <name> : remove all exam files
pt_br: remove <nome> : remove todos os arquivos do exame

source: clone <e1> <e2> : copy exam e1 to e2
pt_br: clone <e1> <e2> : copia o exame e1 para e2

source: Common use: init | clone > new > latex
pt_br: Uso comum: init | clone > new > latex

source: Common use: init | clone > generate
pt_br: Uso comum: init | clone > generate

source: Error translating number to letter - answer: {}
pt_br: Erro traduzindo número para letra - resposta: {}

source: ERROR: {}
pt_br: ERRO: {}

source: Syntax error: {}
pt_br: Erro de sintaxe: {}

source: Please respond with 'y' (yes) or 'n' (no) or 'c' (cancel).
pt_br: Por favor, respoda com 'y' (sim) ou 'n' (não) ou 'c' (cancelar).

source: Directory {} already exists. Can overwrite files?
pt_br: Diretório {} já existe. Pode sobrescrever os arquivos?

source: Removing files...
pt_br: Removendo arquivos...

source: To make a new exam, files need to be overwritten. Try again.
pt_br: Para fazer um novo exame, os arquivos precisam ser sobrescritos. Tente novamente.

source: !!! Creation of the directory {} failed
pt_br: !!! Criação do diretório {} falhou

source: !!! Template file {} does not exist
pt_br: !!! Arquivo de template {} não existe

source: Copying file {}...
pt_br: Copiando arquivo {}...

source: Too few questions in database to create exam: {} questions stored but {} questions solicited.
pt_br: Muito poucas questões na base de dados para criar o exame: {} questões armazenadas mas {} questões requeridas.

source: Question type : {}
pt_br: Tipo da questão : {}

source: Questions in database : {}
pt_br: Questões na base de dados : {}

source: Questions in exam : {}
pt_br: Questões do exame : {}

source: Generating {} questions...
pt_br: Gerando {} questões...

source: Score of each question {}
pt_br: Nota de cada questão {}

source: Insufficient questions to make this exam. Need {} but only can choose {} with all restrictions.
pt_br: Questões insuficientes para fazer este exame. Necessário {} mas somente pode escolher {} com todas as restrições.

source: File {} already exists. Want to overwrite?
pt_br: Arquivo {} já existe. Quer sobrescrever?

source: File {} maintained.
pt_br: Arquivo {} mantido.

source: Exam {} initialized.
pt_br: Exame {} inicializado.

source: File {} created.
pt_br: Arquivo {} criado.

source: Generating exam {}.
pt_br: Gerando exame {}.

source: Exam {} created.
pt_br: Exame {} criado.

source: Cloning exam {}.
pt_br: Gerando exame {}.

source: Want to remove files in directory {} ?
pt_br: Quer remover os arquivos do diretório {} ?

source: Removing files in {}
pt_br: Removendo arquivos em {}

source: Nothing to clear, {} directory does not exists.
pt_br: Nada para limpar, diretório {} não existe.

source: Want to remove all exam files ({}) ?
pt_br: Quer remover todos os arquivos do exame ({}) ?

source: Questions Path : {}
pt_br: Caminho das questões : {}

source: Question not in folder (not counted): {}
pt_br: Questões fora da pasta (não contadas): {}

source: Compiling TEX files from exam {}.
pt_br: Compilando arquivos TEX do exame {}.

source: !!! Error generating exam: {}.pdf not generated.
pt_br: !!! Erro gerando exame: {}.pdf não gerado.

source: Backing up file {}.pdf to {}_bak.pdf
pt_br: Salvando arquivo {}.pdf para {}_back.pdf

source: PDF generated {}.pdf.
pt_br: PDF gerado {}.pdf

source: Insufficient parameters for command {} : {}
pt_br: Parâmetros insuficientes para o comando {} : {}

source: Invalid command {}.
pt_br: Comando inválido {}.
